{"class_name": "Model", "keras_version": "2.2.4", "config": {"name": "model_1", "output_layers": [["sequential_1", 1, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [null, 1], "sparse": false}}, {"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 5000, 7], "sparse": false}}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"n": 35000, "trainable": true, "name": "repeat_vector_1"}}, {"name": "flatten_3", "class_name": "Flatten", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}}, {"name": "multiply_1", "class_name": "Multiply", "inbound_nodes": [[["flatten_3", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_1"}}, {"name": "sequential_1", "class_name": "Sequential", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": {"name": "sequential_1", "build_input_shape": [null, 35000], "layers": [{"class_name": "Reshape", "config": {"target_shape": [5000, 7], "trainable": true, "name": "reshape_1"}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 32, "batch_input_shape": [null, 5000, 7], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [2], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_1", "dilation_rate": [1]}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [2], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_2", "dilation_rate": [1]}}, {"class_name": "ZeroPadding1D", "config": {"padding": [0, 0], "trainable": true, "name": "zero_padding1d_1"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.8, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_1"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null, "rate": 0.5}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 128, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [2], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_3", "dilation_rate": [1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.8, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_2"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null, "rate": 0.5}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 256, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_4", "dilation_rate": [1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.8, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_3"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_4", "seed": null, "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 1, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "bias_regularizer": null}}]}}]}, "backend": "tensorflow"}