{"class_name": "Model", "keras_version": "2.2.4", "config": {"name": "model_2", "output_layers": [["sequential_2", 1, 0]], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "layers": [{"name": "input_4", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_4", "dtype": "float32", "batch_input_shape": [null, 1], "sparse": false}}, {"name": "repeat_vector_2", "class_name": "RepeatVector", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"n": 100, "trainable": true, "name": "repeat_vector_2"}}, {"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_3", "dtype": "float32", "batch_input_shape": [null, 100], "sparse": false}}, {"name": "flatten_4", "class_name": "Flatten", "inbound_nodes": [[["repeat_vector_2", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last"}}, {"name": "multiply_2", "class_name": "Multiply", "inbound_nodes": [[["input_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_2"}}, {"name": "sequential_2", "class_name": "Sequential", "inbound_nodes": [[["multiply_2", 0, 0, {}]]], "config": {"name": "sequential_2", "layers": [{"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 100], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 160000, "activation": "LeakyReLU", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_2", "bias_regularizer": null}}, {"class_name": "Reshape", "config": {"target_shape": [1250, 128], "trainable": true, "name": "reshape_2"}}, {"class_name": "UpSampling1D", "config": {"trainable": true, "name": "up_sampling1d_1", "size": 2}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 128, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_5", "dilation_rate": [1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.8, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_4"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "UpSampling1D", "config": {"trainable": true, "name": "up_sampling1d_2", "size": 2}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 64, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_6", "dilation_rate": [1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.8, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_5"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_7"}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "filters": 7, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1], "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "conv1d_7", "dilation_rate": [1]}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_8"}}]}}]}, "backend": "tensorflow"}